   IDENTIFICATION DIVISION.
   PROGRAM-ID. ADDITION.

   DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 NUM1        PIC 9(5) VALUE 0.
   01 NUM2        PIC 9(5) VALUE 0.
   01 RESULT      PIC 9(6) VALUE 0.

   PROCEDURE DIVISION.
   MAIN-PARA.
       DISPLAY "Enter the first number: " WITH NO ADVANCING.
       ACCEPT NUM1.
       DISPLAY "Enter the second number: " WITH NO ADVANCING.
       ACCEPT NUM2.
       COMPUTE RESULT = NUM1 + NUM2.
       DISPLAY "The result of addition is: " RESULT.
       STOP RUN.